{
  "items": [
    {
      "approved": true,
      "country": "USA",
      "demandrateunit": "kW",
      "demandunits": "kW",
      "description": "APPLICABILITY: To all New Large Loads, as defined by the District's Customer Service\r\nPolicies. Service to such loads will be in accordance with the terms of this rate schedule.\r\nEFFECTIVE:With meter readings on and after January 1, 2010. Bills received by the customers will be based on the following:\r\nMONTHLY BILLING: Customer's monthly billing will consist of the following energy\r\ncharge:\r\nTheCustomer's monthly energy charge shall be the greater of: the \"Weighted Average Index Price\" reflected by the Intercontinental Exchange (ICE) Daily Power Indices for theMid C at peak and off-peak for the month or the largest energy block on Rate Schedule 15.- Large Industrial Service , plus a 5% premium.\r\nThe \"Weighted Average Index Price\" shall mean the Intercontinental Exchange (ICE) Daily Power Indices for the Mid-C prices for power traded for peak hours 0600 through 2200 Pacific Prevailing Time (PPT) for Monday through Saturday multiplied by the number of peak hours during the applicable month plus the average price of power traded for off-peak hours 2200 through 0600 PPT for Monday through Saturday multiplied by the number of off-peak hours for the applicable month plus the average price of power traded for the 24 off-peak hours for Sundays and Holidays (as observed by the National Energy Regulatory Commission) during each month multiplied by the number of Sunday and Holiday hours for the applicable month all divided by\r\nthe total number of hours in the applicable month. \r\nTAXADJUSTMENT: The amounts of any tax levied by any city or town, in accordance with RCW 54.28.070 of the Laws of the State of Washington, will be added to the above charges. \r\nSERVICE: Service under this Schedule is subject to the terms and conditions in the District's Customer Service Policies, as the same may be amended from time to time.",
      "eiaid": 14624,
      "enddate": 1522479600,
      "label": "539f7516ec4f024411ed0fa5",
      "name": "New Large Load Service (Rate Schedule No. 94)",
      "revisions": [
        1340227447,
        1340227483,
        1340227542,
        1355004571,
        1370289639,
        1403095539,
        1408529474,
        1427405206,
        1461942411,
        1527004066
      ],
      "sector": "Commercial",
      "source": "http://grantpud.org/customer-service/payments-billing/rates-and-fees",
      "startdate": 1262246400,
      "uri": "https://apps.openei.org/IURDB/rate/view/539f7516ec4f024411ed0fa5",
      "utility": "PUD No 2 of Grant County"
    }
  ]
}